// // 주석 처리
// /* 
//  여러줄 주석
// */ 
// // 변수와 상수 : var, let, const
// // var : es6 이전에 사용하던 변수 생성 문법 (호이스팅), 중복 선언 가능, 재할당 가능
// // let : 변수 선언 문법, 자바의 변수의 형태와 동일, 중복 선언 불가, 재할당 가능, es6에서 추가 
// // const : 상수 선언, 재할당 불가, es6에서 추가 

// // 호이스팅 : 끌어 올림. 변수가 결과 보다 나중에 선언되어도 실행은 된다.
// // -> 호이스팅은 자바스크립트가 해석하기 쉽게 변수를 가장 먼저 읽고 결과를 출력한다.
// // a라는 변수가 없기 때문에 에러 발생
// // var a = 100;
// // var a = 200;
// console.log(a);
// var a;
// // [Running] node "d:\dev\frontend\JavaScript\src\기초.js"
// // undefined
// // 실행은 되고 정의 되지 않았다는 결과를 보여줌

// // let은 var과 달리 호이스팅이 없어서 오류가 발생
// // console.log(b);
// // let b;
// let b = 100;
// b = 200;
// // //  vs
// // 오류 발생
// // let c = 100;
// // let c = 200;
// // const d = 100;
// // d = 200;
// // console.log(d)

// 함수는 미리 끌어 올림을 한다.
console.log(sum(10, 20))
function sum(x, y) {
    return x + y;
} 





